In [1]:
#importing libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
data=pd.read_excel('1673872777_ausapparalsales4thqrt2020 (2).xlsx')

In [3]:
data.head()

        Date        Time State     Group  Unit  Sales
0 2020-10-01     Morning    WA      Kids     8  20000
1 2020-10-01     Morning    WA       Men     8  20000
2 2020-10-01     Morning    WA     Women     4  10000
3 2020-10-01     Morning    WA   Seniors    15  37500
4 2020-10-01   Afternoon    WA      Kids     3   7500

In [4]:
data.shape

(7560, 6)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7560 entries, 0 to 7559
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    7560 non-null   datetime64[ns]
 1   Time    7560 non-null   object
 2   State   7560 non-null   object
 3   Group   7560 non-null   object
 4   Unit    7560 non-null   int64
 5   Sales   7560 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 354.5+ KB

In [6]:
data.sort_values(by='Sales',inplace=True)

In [7]:
data.head()

           Date        Time State     Group  Unit  Sales
4622 2020-11-26     Morning    WA     Women     2   5000
4451 2020-11-23     Evening   TAS   Seniors     2   5000
3867 2020-11-17     Morning    WA   Seniors     2   5000
2851 2020-11-04   Afternoon   TAS   Seniors     2   5000
3454 2020-11-12     Evening    WA     Women     2   5000

In [8]:
#missing value check
data.isna().sum()

Date     0
Time     0
State    0
Group    0
Unit     0
Sales    0
dtype: int64

In [9]:
data.describe()

              Unit          Sales
count  7560.000000    7560.000000
mean     18.005423   45013.558201
std      12.901403   32253.506944
min       2.000000    5000.000000
25%       8.000000   20000.000000
50%      14.000000   35000.000000
75%      26.000000   65000.000000
max      65.000000  162500.000000

### Analysis

In [10]:
#group is generating the highest sales,
data.groupby('Group')['Sales'].sum().idxmax()

' Men'

In [11]:
#group is generating the lowest sales
data.groupby('Group')['Sales'].sum().idxmin()

' Seniors'

In [12]:
#state is generating the highest sales
data.groupby('State')['Sales'].sum().idxmax()

' VIC'

In [13]:
#state is generating the lowest sales
data.groupby('State')['Sales'].sum().idxmin()

' WA'

In [14]:
data['Month']=data['Date'].dt.month

In [15]:
monthly_report= data.groupby('Month')['Sales'].sum()
monthly_report

Month
10    114290000
11     90682500
12    135330000
Name: Sales, dtype: int64

In [16]:
data['Year']=data['Date'].dt.year
data.head()

           Date        Time State     Group  Unit  Sales  Month  Year
4622 2020-11-26     Morning    WA     Women     2   5000     11  2020
4451 2020-11-23     Evening   TAS   Seniors     2   5000     11  2020
3867 2020-11-17     Morning    WA   Seniors     2   5000     11  2020
2851 2020-11-04   Afternoon   TAS   Seniors     2   5000     11  2020
3454 2020-11-12     Evening    WA     Women     2   5000     11  2020

In [17]:
data.set_index('Date',inplace=True)

In [18]:
weekly_report=data['Sales'].resample('W').sum()
weekly_report

Date
2020-10-04    15045000
2020-10-11    27002500
2020-10-18    26640000
2020-10-25    26815000
2020-11-01    21807500
2020-11-08    20865000
2020-11-15    21172500
2020-11-22    21112500
2020-11-29    21477500
2020-12-06    29622500
2020-12-13    31525000
2020-12-20    31655000
2020-12-27    31770000
2021-01-03    13792500
Freq: W-SUN, Name: Sales, dtype: int64

In [19]:
quarterly_report=data['Sales'].resample('Q').sum()
quarterly_report

Date
2020-12-31    340302500
Freq: Q-DEC, Name: Sales, dtype: int64

In [20]:
daily_report=data['Sales'].resample('D').sum()
daily_report

Date
2020-10-01    3720000
2020-10-02    3715000
2020-10-03    3890000
2020-10-04    3720000
2020-10-05    3862500
               ...
2020-12-26    4715000
2020-12-27    4637500
2020-12-28    4595000
2020-12-29    4607500
2020-12-30    4590000
Freq: D, Name: Sales, Length: 91, dtype: int64

### Visualisation

In [ ]:
sns.
plt.title('State-wise sales analysis for different groups ')
plt.xlabel('State')
plt.ylabel('Sales')
plt.legend(title='Group')
# Display the plot
plt.show()

In [ ]:
#Group-wise sales analysis across different states
grouped_data = data.groupby(['Group', 'State'])['Sales'].sum().reset_index()
pivot_df = grouped_data.pivot(index='Group', columns='State', values='Sales')
# Plotting
ax = pivot_df.plot(kind='bar', figsize=(10,8))
plt.title('Group-wise sales analysis across different states')
plt.xlabel('Group')
plt.ylabel('Sales')
plt.legend('State')
# Display the plot
plt.show()

In [ ]:
plt.figure(figsize=(15,8))
#weekly sales report
plt.subplot(1,2,1)
plt.plot(weekly_report)
plt.title('Weekly Sales Report')
plt.xlabel('Week')
plt.ylabel('Sales')
#monthly sales report
plt.subplot(1,2,2)
plt.plot(monthly_report)
plt.title('Monthly Sales Report')
plt.xlabel('Month')
plt.ylabel('Sales')
plt.show()

In [ ]:
plt.subplot(1,2,1)
plt.plot(quarterly_report)
plt.title('Quarterly Sales Report')
plt.xlabel('Quarter')
plt.ylabel('Sales')
plt.show()

In [ ]:
plt.figure(figsize=(15,8))
plt.plot(daily_report)
plt.title('Daily Sales Report')
plt.xlabel('Day')
plt.ylabel('Sales')
plt.show()

In [ ]:
data.groupby('Time')['Sales'].sum().plot(kind='line')
plt.xlabel('Time')
plt.ylabel('Sales')
plt.title('Time-of-the-day analysis')
plt.grid()
plt.show()